# -*- coding: utf-8 -*-
# author: wt
# date: '2018/12/14 0014 14:30'

import datetime
# current_date = datetime.datetime.now().strftime("%Y-%m-%d")
# target_date = "2019-01-28"
# date1 = datetime.datetime.strptime(target_date, "%Y-%m-%d")
# date2 = datetime.datetime.strptime(current_date, "%Y-%m-%d")
# print((date1 - date2).days)


class Zhinan(object):

    def __init__(self):
        self.first_data = "2019-02-05"
        self.datas = {
            "2019-01-28": "腊月二十三又称小年夜，是中国传统文化中祭灶、扫尘、吃灶糖的日子。民谣中“二十三，糖瓜粘”指的即是每年腊月二十三或二十四日的祭灶神，有所谓“官三民四船家五”或“官三民四僧道五”的说法，也就是官府在腊月二十三日，一般民家在二十四日，水上人家或寺庙、道观则在二十五日举行祭灶。后逐渐演化为“二十三，过小年”的说法。",
            "2019-01-29": "扫尘日，即腊月二十四，所谓“扫尘”就是年终大扫除，家家户户清扫蛛网扬尘、清洗。虽说“二十四，扫尘日”，实际上从祭灶前后到年终，均为扫尘时间。中国一些地方，每年从小年（农历腊月二十三）起至除夕止，把这段时间都叫做“扫尘日”，也叫“迎春日”。",
            "2019-01-30": "民谚称：“腊月二十五，磨豆腐。”一些地方还有在除夕以前吃豆腐渣的风俗。民间传说灶王上天汇报后，玉帝会下界查访，看各家各户是否如灶王所奏的那样，于是各家各户就吃豆腐渣以示清苦，瞒过玉皇的惩罚。传说归传说，其实吃豆腐渣实则是古代生产力低下，没有那么多好吃的，(但有时人们也会买一大筐豆腐以吃其来充饥等)。",
            "2019-01-31": "俗话说“腊月二十六，杀猪割肉”或“二十六，割刀头”，说的是这一天主要筹备过年的肉食。将“割年肉”放入年谣，是因为农耕社会经济不发达，人们往往在年节中才能吃到肉，故此称为“年肉”。",
            "2019-02-01": "传统民俗中在这两天要集中地洗澡、洗衣，除去一年的晦气，准备迎接来年的新春，京城有“二十七洗疚疾，二十八洗邋遢”的俗语。腊月二十六洗浴为“洗福禄”。",
            "2019-02-02": "年谣云：“腊月二十八，打糕蒸馍贴花花”或“二十八，把面发”。所谓贴花花，就是张贴年画、春联、窗花和各种春节张贴之物。",
            "2019-02-03": "除夕前一日的腊月二十八或二十九日，叫小除夕，中国民俗文化。这一天家置酒宴，人们往来拜访叫别岁。焚香于户外，叫天香，通常要三天。",
            "2019-02-04": "岁除，在年的最后一天，通常在农历二十九或三十日。“年”的最后一天称为“岁除”，那天晚上叫“除夕”。除夕，意为“岁除之夜”，又称大年夜、除夕夜、除夜等，时值每年农历腊月（十二月）的最后一个晚上。除，即去除的之意；夕，指夜晚。除夕的意思是“月穷岁尽”，人们都要除旧布新，有旧岁至此而除，来年另换新岁。故此期间以除旧布新为活动主题。自古就有贴年红、祭祖、团年饭、守岁等习俗，流传至今，经久不息。",
            "2019-02-05": "大年初一：今天开始便进入迎接新禧、祭祀神灵、祈求丰年主题。元日子时交年时刻，鞭炮齐响、烟花照天、辞旧岁、迎新年等等各种庆贺新春活动活动达于高潮。记得早早起来，穿上最漂亮的衣服，打扮得整整齐齐，出门去走亲访友，恭祝新年大吉大利。",
            "2019-02-06": "大年初二：金吠报春。亲眷人家去拜年，东家留吃饭、西家排酒筵。",
            "2019-02-07": "大年初三：肥猪拱门。女婿女儿回娘家拜年。",
            "2019-02-08": "大年初四：三羊开泰。灶王爷要查户口，恭迎灶神回民间。",
            "2019-02-09": "大年初五：艮牛耕春。五路接财神，东西南北中，财富五路通。",
            "2019-02-10": "大年初六：马到成功。沥酒拜街中。万户千门看，无人不送穷。",
            "2019-02-11": "大年初七：人寿年丰。摊煎饼吃七宝羹，安顿身心，休养生息。",
            "2019-02-12": "大年初八：放生祈福。众星下界之日，制小灯燃而祭之。",
            "2019-02-13": "大年初九：玉皇天诞。是主宰宇宙最高的神，人们都会举行祭典庆贺。",
            "2019-02-14": "大年初十：祭石感恩。有天还有地，人畜房米麦百谷都生地。",
            "2019-02-15": "正月十一：祭奉紫姑。古代女性把她奉为弱女子的保护神。",
            "2019-02-16": "正月十二：搭建灯棚。元宵节将近，做元宵赏灯的准备工作。",
            "2019-02-17": "正月十三：灶下点灯。预放元宵，自十三日起，巷陌桥道，皆编竹张灯。",
            "2019-02-18": "正月十四：临水娘娘诞辰，又称“顺天圣母”，是拯救难产妇女的神仙。",
            "2019-02-19": "正月十五：夜照田蚕（神）。观颜色判断一年的丰歉，后演化为元宵节观灯。"
        }

    def has_key(self, key):
        return key in self.datas

    def get_data(self, key):
        return self.datas[key]

    def get_current_date(self):
        return datetime.datetime.now().strftime("%Y-%m-%d")

    def d_value(self, date, target_date=None):
        if target_date is None:
            target_date = self.first_data
        date1 = datetime.datetime.strptime(target_date, "%Y-%m-%d")
        date2 = datetime.datetime.strptime(date, "%Y-%m-%d")
        return (date1 - date2).days


if __name__ == "__main__":
    zhinan = Zhinan()
    print(zhinan.d_value('2018-12-14'))
    print(zhinan.has_key('2019-02-19'))